In [12]:
from sqlalchemy import create_engine

import pymysql

import pandas as pd
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
 
a = "mysql+pymysql://root:NewPassword@localhost:3306"
sqlEngine       = create_engine(a, pool_recycle=3600)

test    = sqlEngine.connect()
                                                                                                                                                                                                            
frame           = pd.read_sql("select * from besant.emp", test);

 

pd.set_option('display.expand_frame_repr', False)

print(frame)

 

#dbConnection.close()

  id   name salary
0  1  kiran   1000
1  2   arun   2000

In [3]:
frame['name'] = frame['name'].replace(["dinesh"],"kiran")

In [4]:
frame

  id   name salary
0  1  kiran   1000
1  2   arun   2000

In [5]:
frame.to_sql(con=test, schema = "besant" , name='emp', if_exists='replace', index=False)

In [9]:

import pandasql
from pandasql import sqldf

In [13]:
a = sqldf("select * from frame where  id = 1")

In [14]:
a

  id   name salary
0  1  kiran   1000

In [17]:
a['id'] = a['id'].replace(["1"],"3")

In [18]:
a

  id   name salary
0  3  kiran   1000

In [19]:
a.to_sql(con=test, schema = "besant" , name='emp', if_exists='append', index=False)